#!/bin/python

元素类型 = {
        "关键词语": ["定义", "如果", "否则", "循环", "函数"],
        "标识名称": ["变量名称", "函数名称"],
        "运算符号": ["=", "+", "-", "*", "/", "==" ,"!=", ">", "<", ">=", "<="]
        "分隔符号": ["(", ")", "{", "}", ":"]
        "注释符号": ["//", "#", "/*", "*/", "--", "%", ";", "#=", "=#"]
}


import re
import os
import sys

if len(sys.argv) > 1:
    文件路径 = sys.argv[1]

if not os.path.exists(文件路径):
    print(f"错误: 路径不存在 - {文件路径}")
    sys.exit(1)

print(f"正在解析的文件路径： {文件路径}")

with open(文件路径, 'r', encoding='utf-8') as f:
    文件内容 = f.read()

print(f"正在解析的文件内容： {文件内容}")

一维数组 = 文件内容.splitlines()
二维数组 = []

for 一维元素 in 一维数组:
    列表元素 = 一维元素.split( )
    if 列表元素:
        二维数组.append(列表元素)

print(f"正在解析结构文本： {二维数组}")

变量列表 = {}

for 一维数组 in 二维数组:
    一维数组 = 一维数组
    关键词语 = 一维数组[0]
    if 关键词语 == "定义":
        变量名称 = 一维数组[1].split("：")[1]
        变量类型 = 一维数组[1].split("：")[0]
        变量内容 = 一维数组[3]
        变量列表[变量名称] = {}
        变量列表[变量名称]["类型"] = 变量类型
        变量列表[变量名称]["内容"] = 变量内容
else:
    match = re.match(r'^([^(]+)\(([^)]*)\)', 关键词语)
    if match:
        函数名称 = match.group(1).strip()
        函数参数 = match.group(2).strip()
        print(函数名称, 函数参数)
        if 函数名称 == "输出":
            print(变量列表[函数参数]["内容"])

print(变量列表)





